SeongMin1000/Embedded_System/micro_os/NUCLEO-f429zi_example_code (updated)/Examples/ST/STM32F429II-SK/OS3/app.c
  while (DEF_TRUE)
  {
    // 1. 알람 발생까지 대기 (알람 ON 신호 올 때까지 무한대기)
    flags = OSFlagPend(&AlarmFlagGroup,
                       ALARM_FLAG_START,
                       0,
                       OS_OPT_PEND_FLAG_SET_ANY + OS_OPT_PEND_BLOCKING,
                       0,
                       &err);

    // 2. 부저 울림 반복 (알람 OFF 신호 올 때까지)
    static const char msg_on[] = "\r\n[부저] 알람이 울리는 중...\r\n 터치 센서를 눌러 미션을 수행하세요!\r\n";
    OSQPost(&USARTMsgQ, (void *)msg_on, sizeof(msg_on), OS_OPT_POST_FIFO, &err);

    while (DEF_TRUE)
    {
      // 깜빡임 효과 (비프 ON)
      Buzzer_On();
      OSTimeDlyHMSM(0, 0, 0, 500, OS_OPT_TIME_HMSM_STRICT, &err); // 0.3초 ON

      // 깜빡임 효과 (비프 OFF)
      Buzzer_Off();
      OSTimeDlyHMSM(0, 0, 0, 500, OS_OPT_TIME_HMSM_STRICT, &err); // 0.2초 OFF

      // 알람 OFF 신호가 들어왔는지 체크
      if (OSFlagPend(&AlarmFlagGroup,
                     ALARM_FLAG_OFF,
                     0,
                     OS_OPT_PEND_FLAG_SET_ANY + OS_OPT_PEND_NON_BLOCKING,
                     0,
                     &err))
      {
        // 바로 종료 (알람 OFF)
        break;
      }
    }

    // 3. 부저 완전히 종료
    Buzzer_Off();
    static const char msg_off[] = "[부저] 알람이 해제되었습니다.\r\n";
    OSQPost(&USARTMsgQ, (void *)msg_off, sizeof(msg_off), OS_OPT_POST_FIFO, &err);
  }
}

// Touch Sensor Task
static void TouchSensorTask(void *p_arg)
{
  OS_ERR err;
  OS_FLAGS flags;
  uint8_t prev, curr;

  (void)p_arg;

  while (DEF_TRUE)
  {
    // 1. 알람 울림 신호 기다림
    flags = OSFlagPend(&AlarmFlagGroup,
                       ALARM_FLAG_START,
                       0,
                       OS_OPT_PEND_FLAG_SET_ANY + OS_OPT_PEND_BLOCKING,
                       0,
                       &err);

    char buf[64];
    snprintf(buf, sizeof(buf), "[TouchTask] FlagPend err=%d flags=0x%02X\r\n", err, flags);
    USART_SendString(buf);

    // 2. 터치 감지 시작 (단, 한 번만 감지)
    prev = GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_3);

    while (DEF_TRUE)
    {
      curr = GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_3);

      if (curr == Bit_SET && prev == Bit_RESET)
      {
        static const char msg[] = "[터치] 감지됨. 미션 시작!\r\n";
        OSQPost(&USARTMsgQ, (void *)msg, sizeof(msg), OS_OPT_POST_FIFO, &err);

        // mission task에 ready flag post
        OSFlagPost(&AlarmFlagGroup,
                   ALARM_FLAG_TOUCH_READY,
                   OS_OPT_POST_FLAG_SET, // ALL로 넘기면 오류가 남
                   &err);

        // 3. 알람 OFF(해제)될 때까지 대기 (더 이상 터치 감지 X)
        while (1)
        {
          // ALARM_FLAG_OFF 오면 break (휴식 끝)
          if (OSFlagPend(&AlarmFlagGroup,
                         ALARM_FLAG_OFF,
                         0,
                         OS_OPT_PEND_FLAG_SET_ANY + OS_OPT_PEND_BLOCKING,
                         0,
                         &err))
          {
            break;
          }
          OSTimeDlyHMSM(0, 0, 0, 50, OS_OPT_TIME_HMSM_STRICT, &err);
        }
        break; // 바깥 while(DEF_TRUE)로 복귀(즉, 알람 다시 울릴 때까지 감지 X)
      }

      // 터치 감지 전이라면, 계속 감시
      prev = curr;
      OSTimeDlyHMSM(0, 0, 0, 20, OS_OPT_TIME_HMSM_STRICT, &err);
    }
  }
}

// Mission Task
static void MissionTask(void *p_arg)
{
  OS_ERR err;
  OS_FLAGS flags;
  void *msg;
  OS_MSG_SIZE msg_size;
  SensorInput input;

  (void)p_arg;

  while (DEF_TRUE)
  {

    // 1. 터치 감지될 때까지 대기
    flags = OSFlagPend(&AlarmFlagGroup,
                       ALARM_FLAG_TOUCH_READY,
                       0,
                       OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_BLOCKING,
                       0,
                       &err);

    // 2. 미션 랜덤 선택 (여기서는 knock만 사용)
    int knock_missions[] = {1, 2, 3};
    int idx = rand() % (sizeof(knock_missions) / sizeof(int));
    int required_knock = knock_missions[idx];

    static const char start_msg[] = "\r\n[미션] 테스트 모드: 노크 센서만 사용 중!\r\n";
    OSQPost(&USARTMsgQ, (void *)start_msg, sizeof(start_msg), OS_OPT_POST_FIFO, &err);

    char buf[128];
    snprintf(buf, sizeof(buf),
             "[테스트 미션] 노크 %d회를 감지하세요.\r\n", required_knock);
    OSQPost(&USARTMsgQ, (void *)buf, strlen(buf) + 1, OS_OPT_POST_FIFO, &err);

    int mission_success = 0; // 전체 루프용

    while (!mission_success)
    {
      int knock_cnt = 0;
      int mission_fail = 0;

      while (1)
      {
        // 미션 도중에 알람 해제 신호가 오면 바로 탈출
        if (OSFlagPend(&AlarmFlagGroup,
                       ALARM_FLAG_OFF,
                       0,
                       OS_OPT_PEND_FLAG_SET_ANY + OS_OPT_PEND_NON_BLOCKING,
                       0,
                       &err))
        {
          mission_fail = 1; // 루프 즉시 종료
          break;
        }

        msg = OSQPend(&SensorInputQ, 0, OS_OPT_PEND_BLOCKING, &msg_size, 0, &err);
        if (err != OS_ERR_NONE)
          continue;

        input = *(SensorInput *)msg;

        if (input.type == SENSOR_KNOCK)
        {
          knock_cnt++;
        }
        else
        {
          mission_fail = 1;
          static const char fail_msg[] = "[실패] 허용되지 않은 입력입니다. 다시 시도하세요.\r\n";
          OSQPost(&USARTMsgQ, (void *)fail_msg, sizeof(fail_msg), OS_OPT_POST_FIFO, &err);
          break;
        }

        if (knock_cnt >= required_knock)
        {
          static const char success_msg[] = "[성공] 미션 완료! 알람이 해제됩니다.\r\n";
          OSQPost(&USARTMsgQ, (void *)success_msg, sizeof(success_msg), OS_OPT_POST_FIFO, &err);

          OSFlagPost(&AlarmFlagGroup, ALARM_FLAG_OFF, OS_OPT_POST_FLAG_SET, &err);
          mission_success = 1;
          break;
        }
      }

      // 성공했으면 전체 루프 탈출
      if (mission_success)
        break;

      // 실패 시 재도전 안내
      if (mission_fail)
      {
        OSTimeDlyHMSM(0, 0, 0, 700, OS_OPT_TIME_HMSM_STRICT, &err); // 충분히 쉬어주기
                                                                    // 실패했으니 다시 처음으로 루프(미션 안내부터)
      }
    }
  }
}

// USART Task
static void USARTTask(void *p_arg)
{
  OS_ERR err;
  void *msg;
  OS_MSG_SIZE size;

  (void)p_arg;

  while (DEF_TRUE)
  {
    // 메시지 큐에서 문자열 수신 (blocking)
    msg = OSQPend(&USARTMsgQ,
                  0,
                  OS_OPT_PEND_BLOCKING,
                  &size,
                  0,
                  &err);

    if (err == OS_ERR_NONE && msg != NULL)
    {
      // 문자열 출력
      USART_SendString((char *)msg);
    }
  }
}
